// node_modules
import * as React from 'react'
// styles
import * as s from './OurMission.module.css'

export const OurMission = () => {
  return <section className={s.section}>
    <div className={`container ${s.contentWr}`}>
      <h2 className={s.title}>
        Наша місія
      </h2>
      <p className={s.text}>
        Місія Фонду — допомагати дітям, літнім людям і всім, хто потребує підтримки в боротьбі з цукровим діабетом. Ми
        захищаємо соціальні права, поліпшуємо умови життя та медичне обслуговування, організовуємо заходи для
        привернення уваги громадськості до проблем хворих на діабет, консультуємо щодо профілактики та лікування,
        забезпечуємо життєво необхідними апаратами та препаратами.
        Враховуючи російську агресію, сьогодні наш Фонд взяв за основу робити все можливе для підтримки військових, які,
        не шкодуючи життя, захищають нашу країну на передовій. Ми докладаємо всіх зусиль, щоб допомогти збройним силам
        України, а також переселенцям із «гарячих» точок.
      </p>
    </div>
  </section>
}
