// node_modules
import * as React from 'react'
// styles
import * as s from './AboutFund.module.css'
// images
import signature from './img/signature.png'
import founder from './img/founder.jpg'

export const AboutFund = () => {
  return <section className={'section'}>
    <div className={`container ${s.contentWr}`}>
      <div className={s.enigma_1}>
        <h2 className={s.title}>
          Про фонд
        </h2>
        <p className={s.text} style={{marginBottom: '1em'}}>
          «Благодійний фонд допомоги та реабілітації хворих на цукровий діабет» — це міжнародна некомерційна
          організація,
          яка підтримує людей із цим діагнозом по всій Україні.
        </p>
        <p className={s.text}>
          Фонд збирає кошти і спрямовує їх на інформування та практичну допомогу усім, хто її потребує. Літні люди,
          сироти
          та діти із малозабезпечених родин, отримують життєво необхідні медикаменти та прилади: інсулін, тест-смужки,
          глюкометри, єдиний сертифікований в Україні сенсор безперервного контролю рівня глюкози в крові від компанії
          POCTech, а також унікальну систему для загоєння ран німецької компанії Curasonix.
        </p>
        <div className={s.enigma_1_1}>
          <div className={s.name}>
            Эдуард Олександрович Піскунов
            <div className={s.position}>
              Засновник фонду
            </div>
          </div>
          <img className={s.signature} src={signature} alt='Image'/>
        </div>
      </div>
      <div className={s.enigma_2}>
        <img className={s.picture} src={founder} alt='The face of the founder'/>
        <div className={s.position}>
          Засновник фонду
        </div>
        <h3 className={s.name}>
          Эдуард Олександрович Піскунов
        </h3>
        <p className={s.quote}>
          Едуард Олександрович Піскунов, бізнесмен та філантроп, дванадцять років живе з діагнозом «інсулінозалежний
          діабет І типу, тяжка форма».
        </p>
        <div className={s.socialNetworks}>
          <svg viewBox='0 0 32 32'>
            <path
              d='M15.9253 4.35556e-05C11.6948 0.0197862 7.64431 1.71421 4.65986 4.71265C1.67541 7.7111 -4.60654e-05 11.7695 9.49913e-10 16C9.49921e-10 20.2435 1.68571 24.3132 4.68629 27.3137C7.68687 30.3143 11.7565 32 16 32C20.2435 32 24.3131 30.3143 27.3137 27.3137C30.3143 24.3132 32 20.2435 32 16C32 11.7566 30.3143 7.68692 27.3137 4.68633C24.3131 1.68575 20.2435 4.35556e-05 16 4.35556e-05C15.9751 -1.45185e-05 15.9502 -1.45185e-05 15.9253 4.35556e-05ZM22.5413 9.63204C22.6747 9.62938 22.9693 9.66271 23.1613 9.81871C23.2889 9.9295 23.3703 10.0841 23.3893 10.252C23.4107 10.376 23.4373 10.66 23.416 10.8814C23.176 13.412 22.1333 19.5507 21.6027 22.384C21.3787 23.584 20.9373 23.9854 20.5093 24.024C19.5813 24.1107 18.876 23.4107 17.976 22.8214C16.568 21.8974 15.772 21.3227 14.4053 20.4214C12.8253 19.3814 13.8493 18.808 14.7493 17.8747C14.9853 17.6294 19.0787 13.9054 19.1587 13.568C19.168 13.5254 19.1773 13.368 19.084 13.2854C18.9907 13.2027 18.852 13.2307 18.752 13.2534C18.6107 13.2854 16.3613 14.7734 12.004 17.7134C11.364 18.1534 10.7867 18.3667 10.268 18.3534C9.69733 18.3427 8.59867 18.032 7.78133 17.7667C6.77867 17.44 5.98267 17.268 6.052 16.7147C6.088 16.4267 6.48533 16.132 7.24267 15.8307C11.9067 13.7987 15.016 12.4587 16.5733 11.812C21.016 9.96404 21.94 9.64271 22.5413 9.63204Z'
              fill='#0C9A56'/>
          </svg>
          <svg viewBox='0 0 32 32'>
            <path
              d='M32 16.0974C32 7.26141 24.836 0.0974121 16 0.0974121C7.164 0.0974121 0 7.26141 0 16.0974C0 24.0841 5.85067 30.7027 13.5 31.9027V20.7227H9.43733V16.0961H13.5V12.5734C13.5 8.56408 15.8893 6.34808 19.544 6.34808C21.2933 6.34808 23.1253 6.66141 23.1253 6.66141V10.5987H21.1067C19.1187 10.5987 18.4987 11.8321 18.4987 13.0974V16.0974H22.936L22.2267 20.7241H18.4987V31.9041C26.1493 30.7027 32 24.0827 32 16.0974Z'
              fill='#0C9A56'/>
          </svg>
        </div>
      </div>
    </div>
  </section>
}
